Repository: 84000/data-translation-memory
Catalog: toh116-v1.tmx
Source language: bo
Languages: en

source: དེ་ནས་ལྷའི་བུ་དེས་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “The deva Sukuṇḍala then asked him,

source: བྲམ་ཟེ་ཆེན་པོ་ཁྱོད་ས་ག་ལས་འོངས།
en: ‘Great brahmin, where do you come from?’

source: བདག་ནི་ཛེ་ཏའི་ཚལ་ཞེས་བགྱི་བའི་གཙུགས་ལག་ཁང་ནས་མཆིས་སོ། །
en: ‘I come from the monastery named Jetavana.’

source: ས་དེ་ཇི་ལྟ་བུ་ཞིག །
en: ‘What is that place like?’

source: དེ་ནས་བྲམ་ཟེ་དེས་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “The brahmin answered,

source: ས་དེ་ནི་དགའ་བར་བྱེད་པ། ལྷའི་ནོར་བུ་རིན་པོ་ཆེས་ཡོངས་སུ་བརྒྱན་པ། ལྷའི་ཤིང་དཔག་བསམ་གྱིས་ཡོངས་སུ་མཛེས་པར་བྱས་པ། །
en: ‘It is a place that is delightful, filled with divine jewels, and completely beautified by divine wish-granting trees.

source: མེ་ཏོག་ཡིད་དུ་འོང་བ་དག་འབྱུང་བ།
en: There are beautiful flowers,

source: རྫིང་བུ་རྣམ་པ་དུ་མ་གདའ་བ།
en: many kinds of bathing pools,

source: ཚུལ་ཁྲིམས་དང་ལྡན་པ་ཡོན་ཏན་དང་ལྡན་པའི་སྦྱིན་གནས་སྣ་ཚོགས་དག་གདའ་བ།
en: many who have the qualities of right conduct and are worthy recipients for offerings,

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་སྐྱོབ་ཀྱི་ཆོ་འཕྲུལ་དག་གདའ་བ་སྟེ།
en: and there are the miracles of Tathāgata Viśvabhū.

source: ལྷའི་བུ་ས་དེ་ནི་དེ་ལྟར་དགའ་བར་བགྱིད་པའོ། །
en: Son of a deva, that is how pleasant that place is.’

source: བྲམ་ཟེ་ཁྱོད་ཀྱིས་ངེས་པར་བདེན་པར་སྨྲོས་ཤིག །
en: ‘Brahmin, you definitely speak the truth.

source: ཅི་ཁྱོད་ལྷ་ཡིན་ནམ་འོན་ཏེ་མི།
en: Who are you? Are you a deva or a human?

source: མི་ལ་ནི་ཇི་ལྟར་ཁྱོད་ལ་ལྟས་སྣང་བ་དེ་འདྲ་བའི་ལྟས་མེད་དོ། །
en: If you are a human you don’t seem to be one.’

source: ང་ནི་ལྷ་ཡང་མ་ཡིན། མི་ཡང་མ་ཡིན་ཏེ། །
en: ‘I am not a deva and I am not a human.

source: ཕོངས་པ་དང་། བྲེལ་བ་ལ་ཐུགས་རྗེ་བར་བྱེད་པ་བྱང་ཆུབ་ཀྱི་ལམ་སྟོན་པར་བྱེད་པ་སྟེ།
en: I am one who has compassion for the poor and the wretched. I am one who shows them the path to enlightenment.

source: བྱང་ཆུབ་སེམས་དཔའོ། །དེ་ནས་ལྷའི་བུས་ཅོད་པན་དང་རྣ་ཆ་ཕུལ་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: I am a bodhisattva.’ “Deva Sukuṇḍala then offered his diadem and earrings to the brahmin and recited:

source: ཀྱེ་མའོ་ཡོན་ཏན་དག་གི་ཞིང་། །ཉེས་པ་ཐམས་ཅད་རྣམ་སྤངས་པ།
en: ‘Oh, the one who is comprised of qualities Is devoid of all evil.

source: དེ་རིང་ཉིད་དུ་ས་བོན་བཏབ། །དེ་རིང་ཉིད་དུ་འབྲས་བུ་གྲུབ།
en: On this day the seed has been planted, And on this day the fruit has been produced.’

source: དེ་ནས་ལྷའི་བུ་དེས་ཚིགས་སུ་བཅད་པ་དེ་སྨྲས་ནས་དེ་ཉིད་དུ་སོང་ངོ་།
en: “After the deva had recited this verse, the brahmin departed.

source: དེ་ནས་བྲམ་ཟེ་ཆེན་པོ་དེ་ལྷའི་རིས་དེ་ནས་བབས་ཏེ་སིང་གྷ་ལའི་གླིང་དུ་སོང་ངོ་།
en: “The great brahmin descended from the deva realms to the island of Siṃhala.

source: སོང་ནས་འདོད་པའི་གཟུགས་སུ་སྤྲུལ་ཏེ་སྲིན་མོ་རྣམས་ཀྱི་མདུན་དུ་འདུག་པ་དང་།
en: Arriving there, he transformed himself into a handsome form and approached the rākṣasīs.

source: གཟུགས་བཟང་པོ་མཐོང་ནས་དེའི་ཚེ་འདོད་པའི་སེམས་སྐྱེས་སོ། །
en: When they saw his handsome body they desired him.

source: གང་གི་ཚེ་ན་འདོད་པའི་སེམས་སྐྱེས་པ་དེའི་ཚེ་དེའི་དྲུང་དུ་སོང་སྟེ་ཕྱིན་ནས་བདག་ཅག་དང་སྟེན་ཅིག
en: Desiring him, they came to him and said,

source: བདག་ཅག་ནི་བུད་མེད་གཞོན་ནུའོ། །བདག་ཅག་ལ་ནི་ཁྱིམ་ཐབ་མ་མཆིས་སོ།
en: ‘Sir, take us young women. We have no husband.

source: བདག་པོ་མ་མཆིས་པའི་ནི་བདག་པོར་གྱུར་ཅིག །
en: For we who have no husband, be a husband.

source: མགོན་མ་མཆིས་པའི་ནི་མགོན་དུ་གྱུར་ཅིག །
en: For we who have no protector, be a protector.

source: རྟེན་མ་མཆིས་པའི་ནི་རྟེན་དུ་གྱུར་ཅིག །
en: For we who have no support, be a support.

source: འདི་ནི་ཁྱོད་ཀྱིས་ཟས་ཀྱི་ཁབ་བོ། །ན་བཟའི་ཁབ་བོ། །སྐྱེད་མོས་ཚལ་དགའ་བར་བགྱིད་པ་དག་ལགས་སོ། །རྫིང་བུ་དགའ་བར་བགྱིད་པ་དག་ལགས་སོ།
en: These are your homes with food; homes with drink; and homes with clothes and a variety of multicolored beds, beautiful gardens, and beautiful pools.’

source: གལ་ཏེ་བདག་གིས་བསྒོ་བ་བཞིན་དུ་བྱེད་ནའོ། །
en: ‘Only if you do as I command.’

source: བདག་ཅག་བགྱིད་དོ། །
en: ‘We will!’

source: དེས་དེ་དག་ལ་འཕགས་པའི་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ལམ་ཡང་བསྟན།
en: “He then taught them the noble eightfold path.

source: ཞལ་ནས་གསུངས་པ་བཞི་ཡང་ཁ་ཏོན་བྱེད་དུ་བཅུག་ནས་
en: He made them recite the fourfold scriptures.

source: ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་ཡང་ཐོབ།
en: Some of them attained the result of becoming a once-returner,

source: ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ཡང་ཐོབ་ནས་
en: and some attained the result of becoming a non-returner.

source: སྲིན་མོ་དེ་དག་ལ་འདོད་ཆགས་ཀྱི་སྡུག་བསྔལ་མི་ལྡང་སེམས་ཞེ་སྡང་བར་ཡང་མི་བྱེད།
en: The rākṣasīs were no longer afflicted by the suffering of desire, there was no anger in their minds,

source: སུ་ལ་ཡང་སྲོག་གི་བར་ཆད་བྱེད་པར་མི་འདོད། །
en: they did not wish to cause anyone’s death,

source: ཆོས་ལ་མངོན་པར་དགའ་ཞིང་གནས་ལ་སྡོམ་པ་བླངས་ཏེ་
en: they continually delighted in the Dharma, and they took vows.

source: སླན་ཆད་བདག་ཅག་སྲོག་གཅོད་པར་མི་བགྱིད་དོ།
en: They promised, ‘We shall kill no more.

source: འཛམ་བུའི་གླིང་གི་མི་དག་ཇི་ལྟར་ཟས་དང་སྐོམ་གྱིས་འཚོ་བ་བདག་ཅག་ཀྱང་དེ་བཞིན་དུ་འཚོའོ།
en: We will nourish ourselves in the same way that humans do in Jambudvīpa: with food and drink.

source: སླན་ཆད་སྲིན་མོའི་ཚུལ་དུ་མི་བགྱིད་དོ་ཞེས་དེ་འདྲ་བའི་བསླབ་ཚིག་གི་སྡོམ་པ་བླངས་ཏེ་འཁོད་དོ།
en: From now on we will not act like rākṣasīs, and we will keep the upāsikā vows.’ In this way the rākṣasīs took vows.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་སིང་གྷ་ལའི་གླིང་ནས་བྱུང་ནས་
en: “Bodhisattva Mahāsattva Avalokiteśvara then left the island of Siṃhala

source: ཡུལ་ཁོར་མོར་འཇིག་གི་གྲོང་ཁྱེར་ཆེན་པོ་ན་བཤང་བ་དང་། གཅི་བའི་གནས་དེ་ན་སྲིན་བུའི་རིགས་བརྒྱ་སྟོང་དུ་མ་གནས་ནས།
en: and went to a place where many hundreds of thousands of different kinds of insects lived within a cesspit in the great city of Vārāṇasī.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་བུང་བའི་གཟུགས་སུ་སྤྲུལ་ནས་སྒྲ་བུང་བུང་དུ་ཕྱུང་སྟེ།
en: When Bodhisattva Mahāsattva Avalokiteśvara arrived there, he transformed himself into the form of a bee that made a buzzing sound that was heard by the insects as the words,

source: སངས་རྒྱས་ལ་ཕྱག་འཚལ་ལོ་ཞེས་བྱས་པ་དང་། དེ་དག་སངས་རྒྱས་ལ་ཕྱག་འཚལ་ལོ་ཞེས་བྱ་བ་ལ་རྗེས་སུ་དྲན་ནས་འཇིག་ཚོགས་སུ་ལྟ་བའི་རིའི་རྩེ་མོ་ཉི་ཤུ་བྱུང་བ་ཡེ་ཤེས་ཀྱི་རྡོ་རྗེས་བཅོམ་ནས། །
en: Namo buddhāya, namo dharmāya, namaḥ saṃghāya .’ The insects remembered the words namo buddhāya, namo dharmāya, namaḥ saṃghāya , and the thunderbolt of wisdom destroyed the mountain, which has twenty peaks, that is the view of the aggregates as a self,

source: དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའ་ཁ་ན་སྤོས་ཀྱི་དྲི་ཞེས་བྱ་བར་གྱུར་ཏེ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེས་སོ།
en: and they were then all reborn in the realm of Sukhāvatī as bodhisattvas named Sugandhamukha.

source: དེའི་ཚེ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱས་ཏེ།
en: “After Bodhisattva Mahāsattva Avalokiteśvara had ripened those beings,

source: ཁོར་མོར་འཇིག་གི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་སོང་ནས་ཡུལ་མ་ག་དྷཱར་མངོན་དུ་ཕྱོགས་ཏེ་སོང་བ་དང་།
en: he left the great city of Vārāṇasī. “Next he went to Magadha.

source: ཡུལ་མ་ག་དྷཱར་ཕྱིན་ནས་ལོ་ཉི་ཤུར་དགོན་པ་ན་གནས་པའི་སེམས་ཅན་གཅིག་ལ་གཅིག་ཤ་ཟ་བ་དག་མཐོང་ངོ་། །
en: When he arrived in the land of Magadha, he saw beings that had lived for twenty years in the wilderness eating each other’s flesh.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་བདག་གིས་ཐབས་གང་གིས་སེམས་ཅན་འདི་དག་ཚིམ་པར་བྱ་སྙམ་དུ་སེམས་པར་གྱུར་ཏོ།
en: Bodhisattva Mahāsattva Avalokiteśvara wondered, ‘By what method can I bring contentment to these beings?’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་ལྷའི་ཆར་པ་དབབ་པར་བརྩམས་ཏེ། །
en: “Bodhisattva Mahāsattva Avalokiteśvara then caused divine rains to fall.

source: ཐོག་མར་ནི་ཆུའི་ཆར་པའོ་གང་གི་ཚེ་ན་ཆུས་ངོམས་པར་གྱུར་པ་
en: First there was a rain of water, and the water brought them satisfaction.

source: དེའི་འོག་ཏུ་ལྷའི་ཞལ་ཟས་རོ་མཆོག་དང་ལྡན་པས་སྐོན་པ་ཡོངས་སུ་གང་བ་དག་བབ་བོ།
en: Then there came a rain of divine food with supreme flavors, and they were completely filled.

source: གང་གི་ཚེ་ན་ཟས་ཀྱིས་ཡོངས་སུ་ཚིམ་པར་གྱུར་པ་དེའི་ཚེ་འབྲས་ཀྱི་ཆར་བབ་བོ།
en: When they were completely satisfied by eating the food, a rain of grain fell.

source: གཞན་ཡང་ཏིལ་དང་། འབྲས་རྨེའུ་དང་། ཀུ་ལད་ཏའི་འབྲུ་དང་། འབྲས་སོ་བ་དག་བབ་བོ། །
en: Then there fell sesame, rice, jujubes, and wild rice.

source: གང་དང་གང་གི་ཚེ་ན་སེམས་ཅན་དེ་དག་གི་དགོས་པ་སེམས་པར་གྱུར་པ་དེའི་ཚེ་དེ་དག་གི་བསམ་པ་གྲུབ་པར་གྱུར་ཏོ། །
en: Whatever those beings wished for, their wishes were fulfilled each time.

source: དེ་ནས་ཡུལ་མ་ག་དྷཱའི་སེམས་ཅན་དེ་དག་ངོ་མཚར་དུ་གྱུར་ནས་དེ་ཐམས་ཅད་གནས་གཅིག་ཏུ་ངལ་བསོས་སོ། །
en: “Those beings in the land of Magadha were amazed, and they all sat down together.

source: ངལ་བསོས་ནས་གཅིག་ལ་གཅིག་འདི་ལྷ་གང་གི་མཐུ་ཞིག་ཅེས་སྨྲས་པ་དང་། །
en: Seated, they asked each other, ‘What deity manifested all of this?’

source: དེ་ནས་སྐྱེས་བུ་དེ་དག་གི་ནང་ན་རྙིས་པ། རྒན་པ། རྒས་པ། སྒུར་བ། བ་ལང་གི་སྣ་ལྟར་གུག་པ། ལོ་བརྒྱ་སྟོང་དུ་མ་ལོན་པ་ཞིག་ཡོད་པ་དེས་དེ་དག་ལ་སྨྲས་པ། །
en: “Among them there was one being who was many hundreds of thousands of years old. He was aged, old, feeble, hunchbacked, and bent like a cow’s ear. He said to them,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་མ་གཏོགས་པར་ལྷ་གཞན་གང་གི་ཡང་མཐུ་འདི་འདྲ་བར་མི་འགྱུར་རོ།
en: ‘Only Bodhisattva Mahāsattva Avalokiteśvara has this kind of power , no other deity.’

source: དེ་ནས་འཁོར་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་མཚན་མ་ཇི་ལྟ་བུ་ཞེས་དྲིས་སོ། །
en: “Those gathered there asked him, ‘What are the qualities of Bodhisattva Mahāsattva Avalokiteśvara?’

source: དེ་ནས་སྐྱེས་བུ་དེས་ཡོན་ཏན་བཤད་པར་བརྩམས་པ་
en: “The man began to describe Avalokiteśvara’s qualities to them:

source: མུན་པར་གྱུར་པ་རྣམས་ཀྱི་ནི་སྒྲོན་མར་གྱུར་པའོ། །
en: “ ‘He is a lamp for those in darkness.

source: ཉི་མས་གདུངས་ཤིང་ཚིག་པ་རྣམས་ཀྱི་ནི་གདུགས་སུ་གྱུར་པའོ། །
en: He is a parasol for those burned and pained by the sun.

source: སྐོམ་གྱིས་གདུངས་པ་རྣམས་ཀྱི་ནི་ཆུ་བོར་གྱུར་པའོ། །
en: He is a river for those afflicted with thirst.

source: འཇིགས་ཤིང་སྐྲག་པར་གྱུར་པ་རྣམས་ལ་ནི་མི་འཇིགས་པ་སྦྱིན་པར་བྱེད་པའོ། །
en: He gives freedom from fear to those who are terrified and afraid.

source: ནད་ཀྱིས་བཏབ་པ་རྣམས་ལ་ནི་སྨན་པར་གྱུར་པའོ། །
en: He is medicine for those afflicted with sickness.

source: སེམས་ཅན་སྡུག་བསྔལ་བ་རྣམས་ཀྱི་ནི་ཕ་དང་མར་གྱུར་པའོ། །
en: He is a father and mother for beings who suffer.

source: སེམས་ཅན་བསྟིར་མེད་པར་སྐྱེས་པ་རྣམས་ལ་ནི་མྱ་ངན་ལས་འདས་པ་སྟོན་པར་བྱེད་པ་སྟེ།
en: He is a teacher of nirvāṇa to those reborn in Avīci.

source: དེའི་ཡོན་ཏན་གྱི་ཁྱད་པར་ནི་འདི་ལྟ་བུའོ། །
en: Those are his special qualities.

source: གང་དེའི་མཚན་གྱི་རྗེས་སུ་དྲན་པ་དེ་དག་ནི་འཇིག་རྟེན་ན་བདེ་བ་དང་ལྡན་པ་ཡིན་ནོ། །དེ་དག་ནི་འཁོར་བའི་སྡུག་བསྔལ་གྱི་ཐ་མ་ཡོངས་སུ་སྤོང་བའོ། །
en: “ ‘Those who remember his name will have happiness in this world and will completely leave behind every suffering in saṃsāra.

source: གང་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ལ་རྟག་ཏུ་མེ་ཏོག་དང་། པོག་བསྡུས་ཤིང་འབུལ་བའི་སྐྱེས་བུ་གང་ཟག་དེ་དག་ནི་
en: “ ‘Those who continually gather and offer flowers and incense to Bodhisattva Mahāsattva Avalokiteśvara

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་རིན་པོ་ཆེ་སྣ་བདུན་དང་ལྡན་པར་འགྱུར་ཏེ། །
en: will become cakravartin kings who possess the seven jewels.

source: འདི་ལྟ་སྟེ། འཁོར་ལོ་རིན་པོ་ཆེ་དང་། རྟ་རིན་པོ་ཆེ་དང་། བལ་གླང་རིན་པོ་ཆེ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དང་། བུད་མེད་རིན་པོ་ཆེ་དང་། ཁྱིམ་བདག་རིན་པོ་ཆེ་དང་། བློན་པོ་རིན་པོ་ཆེ་དང་བདུན་ཏེ། རིན་པོ་ཆེ་དེ་བདུན་དང་ལྡན་པར་འགྱུར་རོ། །
en: The seven jewels are: the precious wheel, the precious horse, the precious elephant, the precious jewel, the precious wife, the precious householder, and the precious counselor.

source: གང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ལ་མེ་ཏོག་འབུལ་བ་དེ་དག་ནི་ལུས་དྲི་ཞིམ་ཞིང་།
en: “ ‘Those who offer flowers to Bodhisattva Mahāsattva Avalokiteśvara will have aromatic bodies, and

source: གང་ལ་ལར་སྐྱེས་པར་ལུས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: wherever they are reborn, their bodies will be perfect.’

source: སྐྱེས་བུ་དེས་དེ་ལྟར་ཡོན་ཏན་གྱི་ཁྱད་པར་བཤད་ནས་
en: “The old man taught Avalokiteśvara’s special qualities in that way.

source: འཁོར་དེ་དག་བདག་བདག་གི་ཁང་པར་དོང་ངོ་། །
en: Then those gathered there returned to their homes,

source: དེ་ནས་སྐྱེས་བུ་རྙིས་པ་དེས་འཐུན་པའི་ཆོས་བཤད་ནས་དེ་ཡང་བདག་གི་ཁང་པར་སོང་ངོ་། །
en: and the aged man, having taught them an appropriate Dharma, returned to his home,

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་དེ་ཉིད་དུ་ནམ་མཁའ་ལ་མི་སྣང་བར་གྱུར་ཏོ། །
en: and Bodhisattva Mahāsattva Avalokiteśvara vanished into the sky.

source: དེ་ནས་དེ་ནམ་མཁའ་ལ་གནས་བཞིན་དུ་བདག་གིས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་སྐྱོབ་མ་མཐོང་ནས་ཡུན་རིང་ངོ་སྙམ་དུ་བསམས་ནས་དེ་མཐར་གྱིས་ཛེ་ཏའི་ཚལ་གྱི་གཙུག་ལག་ཁང་དུ་ཕྱིན་པ་དང་།
en: “While Bodhisattva Mahāsattva Avalokiteśvara was in the sky he thought, ‘It has been a long time since I’ve seen Tathāgata Viśvabhū,’ and so he next went to Jetavana Monastery.

source: འོང་བ་བཅོམ་ལྡན་འདས་ཀྱིས་གཟིགས་སོ། །
en: Bhagavat Viśvabhū saw him coming.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ཛེ་ཏའི་ཚལ་གྱི་གཙུག་ལག་ཁང་དུ་ཕྱིན་ནས་
en: “As Bodhisattva Mahāsattva Avalokiteśvara approached the Jetavana monastery,

source: ལྷ་དང་ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་ཕྲག་དུ་མ་དག་ཚོགས་པ་ཡང་མཐོང་ངོ་།
en: he saw devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, humans, and nonhumans, and a gathering of many hundreds of bodhisattvas.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་དེ་གང་ཞིག་མཆི།
en: ‘Bhagavat, which bodhisattva is arriving?’

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་དེ་འོང་ངོ་། །
en: ‘This is Bodhisattva Mahāsattva Avalokiteśvara who is arriving.’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་གསུམ་བསྐོར་ནས་གཡོན་ཕྱོགས་སུ་ངལ་བསོས་སོ། །
en: “Bodhisattva Mahāsattva Avalokiteśvara bowed his head to Bhagavat Viśvabhū’s feet, circumambulated him three times, and sat on his left.

source: ཁྱོད་ངལ་ལམ། འཆད་དམ། རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ལས་ཀྱིས་ཇི་ལྟ་བུ་ཞིག་བསྒྲུབས།
en: ‘Are you tired? Are you weary? Noble son, what work have you been doing?’

source: ཁྱོད་ངལ་ལམ། འཆད་དམ།
en: ‘Are you tired? Are you weary?’

source: བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའ་མཛོད་ཤིན་ཏུ་ངོ་མཚར་དུ་གྱུར་ཏོ། །
en: Bodhisattva Gaganagañja was extremely amazed

source: བདག་གིས་བྱང་ཆུབ་སེམས་དཔའི་ཡུལ་འདི་ལྟ་བུ་མ་མཐོང་ངོ་། །
en: ‘I have never seen such a field of activity as that of this bodhisattva.

source: དེ་བཞིན་གཤེགས་པ་དག་ལ་ཡང་ཡུལ་འདི་ལྟ་བུ་མ་མཆིས་ན་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་ལ་ལྟ་ཅི་སྨོས་སྙམ་མོ། །
en: There is no such field of activity among the tathāgatas, let alone among the bodhisattvas.’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའ་མཛོད་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་དྲུང་དུ་སོང་སྟེ། མདུན་དུ་འདུག་གོ། །
en: “Bodhisattva Gaganagañja now came to Bodhisattva Mahāsattva Avalokiteśvara and sat before him.

source: འདུག་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Seated, he asked Bodhisattva Mahāsattva Avalokiteśvara,

source: བདག་ནི་མི་ངལ་ལོ་ཉོན་མ་མོངས་སོ་
en: ‘I am not tired and I am not weary.’

source: ཕན་ཚུན་དུ་གཏམ་བྱས་ནས་ཁ་རོག་སྟེ་འཁོད་དོ། །
en: “They talked with each other and then became silent.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་བཤད་པར་བརྩམས་པས་རིགས་ཀྱི་བུ་དག་ཉོན་ཅིག །
en: “Bhagavat Viśvabhū then began to teach upon the six perfections: “ ‘Noble sons, listen.

source: བྱང་ཆུབ་སེམས་དཔར་གྱུར་པས་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱའོ། །
en: Having become a bodhisattva, you must complete the perfection of generosity.

source: དེ་བཞིན་དུ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱའོ། །།
en: Similarly, you must complete the perfection of conduct, the perfection of patience, the perfection of diligence, the perfection of meditation, and the perfection of wisdom.’

source: ཞེས་ཆོས་དེ་བཤད་ནས་ཅང་མི་གསུང་བར་བཞུགས་སོ། །
en: “Having taught that Dharma he became silent.

source: དེ་ནས་འཁོར་དེ་དག་བདག་བདག་གི་གནས་སུ་དོང་ངོ་། །
en: “The assembled beings each returned to their own dwelling places,

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཀྱང་བདག་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་དོང་ངོ་། །
en: and the bodhisattvas returned to their own buddha realms.”

source: འདི་ནི་ཐེག་པ་ཆེན་པོའི་མདོ་དཀོན་མཆོག་གི་རྒྱལ་པོ་ཟ་མ་ཏོག་བཀོད་པའི་ལེའུ་དང་པོ་སྟེ་རྫོགས་སོ།། །
en: This completes part one of the precious king of the Mahāyāna sūtras, “ The Sūtra of the Basket’s Display

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་སྔོན་ཏིང་ངེ་འཛིན་གང་དག་ལ་མཉམ་པར་བཞག་པར་གྱུར་པ་བཤད་དུ་གསོལ།
en: “Bhagavat, I request that you teach what samādhis Bodhisattva Mahāsattva Avalokiteśvara has previously remained in.”

source: རྣམ་པར་བྱེད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Creation,

source: འོད་བྱེད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Illumination,

source: རྡོ་རྗེ་གྱེན་དུ་འཕགས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Sublime Vajra,

source: ཉི་མའི་འོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Sunlight,

source: འཐོར་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Dispersal,

source: དཔུང་རྒྱན་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: he samādhi named Armlet,

source: རྡོ་རྗེ་རྒྱལ་མཚན་མཆོག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Supreme Vajra Victory Banner,

source: རྒྱན་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Ornament,

source: བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named King of Arrays,

source: ཕྱོགས་བཅུར་རྣམ་པར་ལྟ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Seeing the Ten Directions,

source: ཡིད་བཞིན་གྱི་ནོར་བུ་ལྟ་བུ་སྤྱན་མཆོག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named The Supreme Illumination of the Wish-fulfilling Jewel,

source: ཤིན་ཏུ་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Totally Stable,

source: དགའ་བ་སྦྱིན་པར་བྱེད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Giving Joy,

source: རྡོ་རྗེ་རྒྱལ་མཚན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Vajra Victory Banner,

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རྣམ་པར་ལྟ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Viewing All Worlds,

source: མ་ལུས་པར་འོངས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། །
en: the samādhi named Completely Present,

source: མངོན་པར་འདུད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Truly Bowing Down,

source: སྤྱི་བོར་འཁྱིལ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Coiled at the Crown,

source: ཟླ་བ་ལྟར་སྤྱན་མཆོག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Supreme Illumination by the Moon,

source: གཡོག་སྐྱེ་བོ་མང་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Many Attendants,

source: ལྷའི་རྣ་ཆ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Divine Bright Earrings,

source: བསྐལ་པའི་གླིང་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Lamp of the Eon,

source: ཆོ་འཕྲུལ་སྟོན་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Manifesting Miracles,

source: པད་མོའི་བླ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Supreme Lotus,

source: རྒྱལ་པོའི་དབང་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named King’s Power,

source: བསྟིར་མེད་པ་སྐེམས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Extinguishing Avīci,

source: འབར་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Blazing,

source: ལྷའི་སྤྱན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Divine Circle,

source: བདུད་རྩི་ཐིགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Drop of Amṛta,

source: འོད་ཀྱི་དཀྱིལ་འཁོར་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Circle of Light,

source: རྒྱ་མཚོར་འཇུག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Immersion in the Ocean,

source: གཞལ་མེད་ཁང་གི་སྒོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Door of the Celestial Palace,

source: བྱ་ཀ་ལ་པིང་ཀའི་སྒྲ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Cuckoo’s Song,

source: ཨུད་པ་ལ་སྔོན་པོའི་དྲི་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Scent of the Blue Lotus,

source: ཞོན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Mounted,

source: རྡོ་རྗེའི་གོ་ཆ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Vajra Armor,

source: བལ་གླང་དགའ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Elephant’s Delight,

source: སེང་གེ་རྣམ་པར་རོལ་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Lion’s Play,

source: བླ་ན་མེད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Unsurpassable,

source: འདུལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Subduing,

source: ཟླ་བའི་བླ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། །
en: the samādhi named Moon on High,

source: རྣམ་པ་བཟང་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Shining,

source: འོད་ཟེར་བརྒྱ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Hundred Light Rays,

source: བསྐུས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Sprinkling,

source: སྣང་བར་བྱེད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Beautiful Appearance,

source: ལྷ་མ་ཡིན་ལ་སྐུལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Summoning the Asuras,

source: བསྒོམ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Meditation,

source: མྱ་ངན་ལས་འདའ་བར་སྐུལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Summoning Nirvāṇa,

source: ཚོར་བ་རྣམ་པར་གྲོལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Liberation of Sensation,

source: རྣལ་འབྱོར་བྱེད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Creating Union,

source: དོན་དམ་པ་སྟོན་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Teaching Ultimate Truth,

source: གློག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Lightning,

source: སེང་གེ་གླལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Gaping Lion,

source: འོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Approaching,

source: དྲན་པའི་དབང་པོ་འཕེལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Increasing Power of Mindfulness,

source: མོས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། །
en: the samādhi named Aspiration,

source: རྒྱལ་བའི་ཐེག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: the samādhi named Carriage of Victory,

source: ལམ་སྟོན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: and the samādhi named Teaching the Path.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ནི་ཏིང་ངེ་འཛིན་དེ་དག་དང་ལྡན་ཏེ།
en: “Noble son, Bodhisattva Mahāsattva Avalokiteśvara has those samādhis.

source: དེའི་བ་སྤུའི་ཁུང་བུ་རེ་རེ་ན་ཡང་ཏིང་ངེ་འཛིན་བརྒྱ་སྟོང་དག་གནས་སོ། །
en: In each of his pores there are a hundred thousand samādhis.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་བསོད་ནམས་ཀྱི་ཚོགས་ནི་དཔག་ཏུ་མེད་དོ། །
en: Noble son, Bodhisattva Mahāsattva Avalokiteśvara thus has an incalculable accumulation of merit.

source: བསོད་ནམས་ཀྱི་ཚོགས་དེ་འདྲ་བ་དག་ནི་དེ་བཞིན་གཤེགས་པ་དག་ལ་ཡང་མེད་ན་བྱང་ཆུབ་སེམས་དཔའ་དག་ལ་ལྟ་ཅི་སྨོས།།
en: Even the tathāgatas do not have that kind of accumulation of merit, let alone a bodhisattva.

source: རིགས་ཀྱི་བུ་སྔོན་བྱུང་བ་ང་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་དེའི་ཚེ། ང་ཚོང་པ་ལྔ་བརྒྱ་དང་འགྲོགས་ནས་སིང་གྷ་ལའི་གླིང་དུ་སོང་སྟེ།
en: “Noble son, in the past, when I was a bodhisattva named Siṃhalarāja, I was going to the island of Siṃhala with five hundred merchants.

source: ཤིང་རྟ་དང་། ཁུར་དང་། བམ་པོ་དང་། སྐོན་པ་དང་། རྔ་མོ་དང་། བ་ལང་དང་། བོང་བུ་ལ་སོགས་པས་ཟོང་མང་དུ་བསྐྱས་ཏེ་སིང་གྷ་ལའི་གླིང་དུ་སོང་བ་ལས། གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་འདབ་དང་། གྲོང་ཡེའུ་དང་། ཚོང་དུས་དག་ཏུ་སོང་བ་ལས་སིང་གྷ་ལའི་གླིང་དུ་མ་ཕྱིན་པར་གྲུ་བོ་ཆེ་བཟང་པོ་ཞིག་རྙེད་ནས།
en: We were going to Siṃhala Island bringing much merchandise in chariots, in bags, baskets, and pots, carried by camels, oxen, donkeys, and so on, so as to go to villages, towns, suburbs, cities, and markets. “I found an excellent ship that had been to Siṃhala Island many times.

source: ངས་གདོས་འཛིན་པ་ལ་གླིང་གང་ལོགས་སུ་རླུང་ལངས།
en: I asked the pilot, ‘Toward what lands are the winds blowing?
